; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   fridgetype sinkbasintype microwavetype - receptacletype
   knifetype butterknifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   dressertype carttype sidetabletype tvstandtype safetype - receptacletype
   cellphonetype soapbartype potatotype clothtype bowltype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 - location
   dresser_1 cart_2 sidetable_3 tvstand_4 safe_5 microwave_6 fridge_7 - receptacle
   cellphone_1 soapbar_2 potato_3 cloth_4 bowl_5 - obj
 )
 (:init (receptacletype_0 dresser_1 dressertype) (receptacletype_0 cart_2 carttype) (receptacletype_0 sidetable_3 sidetabletype) (receptacletype_0 tvstand_4 tvstandtype) (receptacletype_0 safe_5 safetype) (receptacletype_0 microwave_6 microwavetype) (receptacletype_0 fridge_7 fridgetype) (objecttype_0 cellphone_1 cellphonetype) (objecttype_0 soapbar_2 soapbartype) (objecttype_0 potato_3 potatotype) (objecttype_0 cloth_4 clothtype) (objecttype_0 bowl_5 bowltype) (cancontain dressertype cellphonetype) (cancontain dressertype clothtype) (cancontain dressertype bowltype) (cancontain carttype soapbartype) (cancontain carttype clothtype) (cancontain sidetabletype cellphonetype) (cancontain sidetabletype soapbartype) (cancontain sidetabletype potatotype) (cancontain sidetabletype clothtype) (cancontain sidetabletype bowltype) (cancontain safetype cellphonetype) (cancontain microwavetype potatotype) (cancontain microwavetype bowltype) (cancontain fridgetype potatotype) (cancontain fridgetype bowltype) (pickupable cellphone_1) (pickupable soapbar_2) (cleanable soapbar_2) (pickupable potato_3) (cleanable potato_3) (heatable potato_3) (coolable potato_3) (sliceable potato_3) (pickupable cloth_4) (cleanable cloth_4) (pickupable bowl_5) (isreceptacleobject bowl_5) (cleanable bowl_5) (coolable bowl_5) (receptacleatlocation dresser_1 location4) (receptacleatlocation cart_2 location4) (receptacleatlocation sidetable_3 location1) (receptacleatlocation tvstand_4 location3) (receptacleatlocation safe_5 location2) (receptacleatlocation microwave_6 location2) (receptacleatlocation fridge_7 location3) (inreceptacle cellphone_1 sidetable_3) (inreceptacle soapbar_2 cart_2) (inreceptacle potato_3 microwave_6) (inreceptacle cloth_4 sidetable_3) (inreceptacle bowl_5 dresser_1) (objectatlocation cellphone_1 location1) (objectatlocation soapbar_2 location4) (objectatlocation potato_3 location2) (objectatlocation cloth_4 location1) (objectatlocation bowl_5 location4) (atlocation agent1 location5) (= (total-cost) 0))
 (:goal (and (exists (?r - receptacle)
 (exists (?o1 - obj)
 (and (inreceptacle ?o1 ?r) (objecttype_0 ?o1 potatotype) (receptacletype_0 ?r fridgetype) (exists (?o2 - obj)
 (and (not (= ?o1 ?o2)) (objecttype_0 ?o2 bowltype) (receptacletype_0 ?r fridgetype) (inreceptacle ?o2 ?r))))))))
 (:metric minimize (total-cost))
)

; plan
1. (gotolocation agent1 location5 location4)
   deleted: (atlocation agent1 location5)
   added: (atlocation agent1 location4)
   goals met: 0 of 1
2. (pickupobject agent1 location4 bowl_5 dresser_1)
   deleted: (inreceptacle bowl_5 dresser_1) (objectatlocation bowl_5 location4)
   added: (holds agent1 bowl_5) (holdsany agent1)
   goals met: 0 of 1
3. (gotolocation agent1 location4 location3)
   deleted: (atlocation agent1 location4)
   added: (atlocation agent1 location3)
   goals met: 0 of 1
4. (putobject agent1 location3 bowl_5 fridge_7 bowltype fridgetype)
   deleted: (holds agent1 bowl_5) (holdsany agent1)
   added: (inreceptacle bowl_5 fridge_7) (objectatlocation bowl_5 location3)
   goals met: 0 of 1
5. (gotolocation agent1 location3 location2)
   deleted: (atlocation agent1 location3)
   added: (atlocation agent1 location2)
   goals met: 0 of 1
6. (pickupobject agent1 location2 potato_3 microwave_6)
   deleted: (inreceptacle potato_3 microwave_6) (objectatlocation potato_3 location2)
   added: (holds agent1 potato_3) (holdsany agent1)
   goals met: 0 of 1
7. (gotolocation agent1 location2 location3)
   deleted: (atlocation agent1 location2)
   added: (atlocation agent1 location3)
   goals met: 0 of 1
8. (putobject agent1 location3 potato_3 fridge_7 potatotype fridgetype)
   deleted: (holds agent1 potato_3) (holdsany agent1)
   added: (inreceptacle potato_3 fridge_7) (objectatlocation potato_3 location3)
   goals met: 1 of 1
